app/views/pacientes/_form.html.erb

SELECT "tb_escolaridade".* FROM "tb_escolaridade" WHERE (fg_ativo = 1)
---
	  <p> <%= form.label :id_escolaridade, "Escolaridade" %> </br>
	  <%= form.select :id_escolaridade, Escolaridade.find(:all, :conditions => ["fg_ativo = :ativo", {:ativo => 1}]).collect {|esc| [esc.ds_escolaridade]} %>