app/views/pacientes_respostas/_form.html.erb

SELECT "tb_alternativas".* FROM "tb_alternativas" WHERE "tb_alternativas"."questao_id" = 1 AND (fg_ativo = true)
---

    <% @questao.alternativas.each do |alternativa|  %>