app/controllers/avaliacoes_controller.rb

SELECT "tb_avaliacao".* FROM "tb_avaliacao"
---
  def index
    @avaliacao = Avaliacao.all