app/controllers/enderecos_controller.rb

SELECT "tb_endereco".* FROM "tb_endereco"
---
  def index
    @enderecos = Endereco.all

SELECT "tb_estados".* FROM "tb_estados" WHERE (fg_ativo = 1)
---
  def new
    @endereco = Endereco.new
    @estados = Estado.all

INSERT INTO "tb_endereco" ("bairro", "cep", "cidade", "complemento", "fg_ativo", "id_estado", "nr", "rua") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id_endereco"  [["bairro", "12"], ["cep", nil], ["cidade", "12"], ["complemento", "casa"], ["fg_ativo", nil], ["id_estado", nil], ["nr", "12"], ["rua", "123"]]
INSERT INTO "tb_paciente" ("convenio", "ds_convenio", "dt_nascimento", "fg_ativo", "id_endereco", "id_escolaridade", "idade", "naturalidade", "nm_paciente", "nr_rg") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id_paciente"
UPDATE "tb_pacientes" SET "endereco_id" = 5 WHERE "tb_pacientes"."id" = 4
---
  def create
    @endereco = Endereco.new(params[:endereco])

    @paciente = session[:paciente]

    respond_to do |format|
      if @endereco.save

        @paciente.endereco_id = @endereco.id

        if @paciente.save

DELETE FROM "tb_endereco" WHERE ("tb_endereco"."id_endereco" = $1)  [["id_endereco", 4]]
---
  def destroy
    @endereco = Endereco.find(params[:id])
    @endereco.destroy