app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "tb_pacientes".* FROM "tb_pacientes"

  def show
    @paciente = Paciente.find(params[:id])
---
SELECT "tb_pacientes".* FROM "tb_pacientes" WHERE "tb_pacientes"."id" = $1 LIMIT 1  [["id", "3"]]

  def new
    @paciente = Paciente.new
    @escolaridade = Escolaridade.find(:all, :conditions => ["fg_ativo = :ativo", {:ativo => 1}])
---
SELECT "tb_escolaridade".* FROM "tb_escolaridade" WHERE (fg_ativo = 1)

  def edit
    @paciente = Paciente.find(params[:id])
---
SELECT "tb_pacientes".* FROM "tb_pacientes" WHERE "tb_pacientes"."id" = $1 LIMIT 1  [["id", "3"]]

  def destroy
    @paciente = Paciente.find(params[:id])
    @paciente.destroy
---
SELECT "tb_pacientes".* FROM "tb_pacientes" WHERE "tb_pacientes"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "tb_pacientes" WHERE ("tb_pacientes"."id" = $1)  [["id", 1]]