app/controllers/pacientes_respostas_controller.rb

  def index
    @paciente_resposta = Paciente_resposta.all
---
SELECT "tb_paciente_resposta".* FROM "tb_paciente_resposta"