app/views/avaliacoes/show.html.erb

</h1>
<% @avaliacao.questoes.each do |questao| %>
---
SELECT "tb_questoes".* FROM "tb_questoes" WHERE "tb_questoes"."avaliacao_id" = 1 AND (fg_ativo = true)